Autodesk.Revit.DB.RoutingCondition.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.RoutingCondition.Diameter
The diameter of the segment or fitting specified for the routing condition.
Since:
2013

Autodesk.Revit.DB.RoutingCondition.#ctor(System.Double)
Creates a new RoutingCondition.
diameter:
The diameter of a routing segment.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for diameter must be greater than 0 and no more than 30000 feet.
Since:
2013

Autodesk.Revit.DB.RoutingCondition
RoutingCondition represents routing information that is used as input when determining if a routing criterion,
such as minimum or maximum diameter, is met.
Since:
2013